In [9]:
import pandas as pd
import numpy as np
import re

# 1. Getting Invoice_id

In [2]:
pd.set_option('display.max_colwidth', -1)
raw=pd.read_csv('trans_ids.txt',sep='\n',header=None)
raw[0]=raw[0].str.replace('"','')
raw.head()

                                                                   0
0  12/11/2018-10:05 2.1.34 3579/ARIF Zae/01;2.1.343579/arifzae/01
1  10/11/2018-16:09 2.1.34 9372/LELITASA/01;2.1.349372/lelitasa/01
2  13/11/2018-19:24 2.1.34 490535/YESI/01;2.1.34490535/yesi/01
3  13/11/2018-17:44 2.1.34 721472/ANA/01;2.1.34721472/ana/01
4  14/11/2018-11:00 2.1.34 36372/OKTAVIAN/01;2.1.3436372/oktavian/01

Checking if the data has more than one ';' on one line

In [3]:
raw['jml']=raw[0].apply(lambda x: x.count(';'))
raw[raw['jml']>1]

                                                           0  jml
972  07/12/2018-09:2; 2.1.34 3637/DIDI/01;2.1.343637/didi/01  2

Deleting the first semicolon if there are 2 of them on one line and store the result on new column

In [4]:
raw['text']=raw[0].apply(lambda x: x.replace(';','',1) if x.count(';')>1 else x)

In [5]:
raw[raw['jml']>1]

,0,jml,text
972,07/12/2018-09:2; 2.1.34 3637/DIDI/01;2.1.343637/didi/01,2,07/12/2018-09:2 2.1.34 3637/DIDI/01;2.1.343637/didi/01

In [6]:
# dropping column '0' and start using column 'text'
raw=raw.drop(0,axis=1)

After making sure the data can be used, then next is separating the trans_id and the invoice_id based on semicolon

In [7]:
new = raw["text"].str.split(";", n = 1, expand = True)
raw['trans_id']=new[0]
raw['inv_id']=new[1]
raw=raw.drop(['text','jml'],axis=1)
raw.head()

                                    trans_id                   inv_id
0  12/11/2018-10:05 2.1.34 3579/ARIF Zae/01   2.1.343579/arifzae/01
1  10/11/2018-16:09 2.1.34 9372/LELITASA/01   2.1.349372/lelitasa/01
2  13/11/2018-19:24 2.1.34 490535/YESI/01     2.1.34490535/yesi/01
3  13/11/2018-17:44 2.1.34 721472/ANA/01      2.1.34721472/ana/01
4  14/11/2018-11:00 2.1.34 36372/OKTAVIAN/01  2.1.3436372/oktavian/01

In [8]:
# Lower the trans_id because inv_id are all on lower cap
raw['trans_id']=raw['trans_id'].str.lower()
raw.head()

                                    trans_id                   inv_id
0  12/11/2018-10:05 2.1.34 3579/arif zae/01   2.1.343579/arifzae/01
1  10/11/2018-16:09 2.1.34 9372/lelitasa/01   2.1.349372/lelitasa/01
2  13/11/2018-19:24 2.1.34 490535/yesi/01     2.1.34490535/yesi/01
3  13/11/2018-17:44 2.1.34 721472/ana/01      2.1.34721472/ana/01
4  14/11/2018-11:00 2.1.34 36372/oktavian/01  2.1.3436372/oktavian/01

### Method to get the invoice_id

In [10]:
def invoice(df):
    inv=''
    for word in df.split():
        if (any(c.isalpha() for c in word)==False) and (re.search('([:_/()*$]|-)',word)) and len(word)>3:
            inv=inv+''
        else:
            inv=inv+word
    return inv

In [11]:
raw['inv_result']=raw['trans_id'].apply(invoice)
raw.count()

trans_id      10939
inv_id        10939
inv_result    10939
dtype: int64

Sneak peek of the result

In [12]:
raw.head()

,trans_id,inv_id,inv_result
0,12/11/2018-10:05 2.1.34 3579/arif zae/01,2.1.343579/arifzae/01,2.1.343579/arifzae/01
1,10/11/2018-16:09 2.1.34 9372/lelitasa/01,2.1.349372/lelitasa/01,2.1.349372/lelitasa/01
2,13/11/2018-19:24 2.1.34 490535/yesi/01,2.1.34490535/yesi/01,2.1.34490535/yesi/01
3,13/11/2018-17:44 2.1.34 721472/ana/01,2.1.34721472/ana/01,2.1.34721472/ana/01
4,14/11/2018-11:00 2.1.34 36372/oktavian/01,2.1.3436372/oktavian/01,2.1.3436372/oktavian/01

In [17]:
raw['truth']=raw['inv_id']==raw['inv_result']
raw['truth'].value_counts()

True     10524
False    415
Name: truth, dtype: int64

In [22]:
raw[raw.truth==False][:10]

,trans_id,inv_id,inv_result,truth
84,00030010091 05082018 14:53:49 0006 60199534 30/870,000300100910006,0003001009105082018000660199534,False
97,"25/08/2018-21:13 2.1.30 936172/cici ap/01 ,40291",2.1.30936172/ciciap/01,"2.1.30936172/ciciap/01,40291",False
98,25/08/2018-20:17 2.1.30 2.1.30 36119/nurul/02,2.1.3036119/nurul/02,2.1.302.1.3036119/nurul/02,False
147,02-09-2018 20:13 000806,2.1.301436330/siti/03,000806,False
189,06-10-2018 16:47:37 m361-703-06109tv4 matu,m361-703-06109tv4,m361-703-06109tv4matu,False
192,06/10/2018-18:13 2.1.30 1539/linawati/01 d1 16,2.1.301539/linawati/01,2.1.301539/linawati/01d116,False
217,08/10/2018-19:33 02/1.30 9147201/yogi a/01,02/1.309147201/yogia/01,9147201/yogia/01,False
243,14/10/2018-12:43 2.1.31 9151149/mega/01 rt 031,2.1.319151149/mega/01031,2.1.319151149/mega/01rt031,False
244,13-10-2018 20:09:52 1p05-159-13105m76 1p05-159-131,1p05-159-1311p05-159-13105m76,1p05-159-13105m761p05-159-131,False
310,03/09/2018-20:59 2.1.30 14307201/ulla/01,103/09/2020-20:592.1.3014307201/ulla/01,2.1.3014307201/ulla/01,False

Some data looks like the trans_id and inv_id doesn't match, maybe the data itself isn't complete or corrupt

In [19]:
(10524/(415+10524))

0.962062345735442

### Akurasi 96.2%

In [27]:
raw.to_csv('the result.csv',index=None)

# 2. Optimization Problem

In [24]:
# method to optimize cost
def optimizer(size,maxDiff,array1):
    arr=np.array(array1)
    
    mins=np.min(arr)
    diff=np.max(arr)-mins
    
    if diff<=maxDiff:
        return 0
    else:
        target=diff-maxDiff
        min_value=mins+int(target/2)
        max_value=min_value+maxDiff
        
        if target%2==1 & (abs(np.sum([(min_value+1)-x for x in arr[arr<min_value+1]]))< abs(np.sum([x-max_value for x in arr[arr>max_value]]))):
            min_value=min_value+1
            max_value=max_value+1
        new_arr=arr.copy()
        new_arr[new_arr>max_value]=max_value
        new_arr[new_arr<min_value]=min_value
        return ((new_arr-arr)*(new_arr-arr)).sum()

Usage example

In [25]:
size=6
maxDiff=12
array=[13,4,27,7,19,33]

In [26]:
print('minimum cost is',optimizer(size,maxDiff,array))

minimum cost is 179